# Путь к сохранённой модели
from Cursach.model_training import load_model, predict_price

model_filename = 'car_price_model_500000.pkl'

# Загрузка обученной модели
model = load_model(model_filename)

# Toyota,RAV4,Джип 5 дв.,Белый,Бензин,2010.0,170000.0,Вариатор,158.0,2.0 CVT Элеганс,3ZR-FAE,2.0,Салехард
# 1279000
# Kia,Cerato,Седан,Белый,Бензин,2019.0,91000.0,АКПП,150.0,2.0 AT GT Line+,G4NA,2.0,Муравленко
# 1980000
# Лада,2110,Седан,Серебристый,Бензин,2001.0,250000.0,Механика,89.0,,1.6i MT 21104,ВАЗ-21124,1.6,Новый Уренгой
# 80000

# Пример предсказания
sample_input = [
    # [
    #     'Toyota', 'RAV4', 'Джип 5 дв.', 'Белый', 'Бензин',
    #     2010.0, 170000.0, 'Вариатор', 158.0, '2.0 CVT Элеганс',
    #     '3ZR-FAE', 1.0, 'Салехард'
    # ]
    # [
    #     'Kia', 'Cerato', 'Седан', 'Белый', 'Бензин',
    #     2019.0, 91000.0, 'АКПП', 150.0, '2.0 AT GT Line+',
    #     'G4NA', 2.0, 'Муравленко'
    # ]
    [
        'Лада', '2110', 'Седан', 'Серебристый', 'Бензин',
        2001.0, 250000.0, 'Механика', 89.0, '1.6i MT 21104',
        'ВАЗ-21124', 1.6, 'Новый Уренгой'
    ]
]  # Пример входных данных

# Получение прогноза
predicted_price = predict_price(model, sample_input)

print(f"Прогнозируемая цена: {predicted_price[0]:,.2f} руб.")
