import joblib
import pandas as pd

# Загрузка сохранённой модели
model = joblib.load('logistic_model_sklearn.pkl')

# 7000
# 65000
# 70000
# 70000
# 95000
# 95000
# 333000
# 340000
# 540000
# 540000
# 1520000
# 1520000
# 1530000
# 1530000
# 1600000
# 1630000
# 1640000
# 1650000
# 2499000
# 3200000

# Данные для проверки
data_to_check = [
    ['Opel', 'Седан', '', 'Бензин', 1986.0, 444000.0, 'Механика', 112.0, 1.8, 'Кировское'],
    ['Лада', 'Седан', '', 'Бензин', 1985.0, 123000.0, 'Механика', 72.0, 1.5, 'Шерловая Гора'],
    ['ГАЗ', 'Седан', '', 'Бензин', 1997.0, 170000.0, 'Механика', 100.0, 2.4, 'Борзя'],
    ['Лада', 'Седан', '', 'Бензин', 1970.0, 73000.0, 'Механика', 64.0, 1.3, 'Чита'],
    ['Лада', 'Седан', '', 'Бензин', 1995.0, 33000.0, 'Механика', 79.0, 1.7, 'Краснокаменск'],
    ['Nissan', 'Универсал', '', 'Бензин', 1998.0, 200000.0, 'АКПП', 125.0, 1.8, 'Чита'],
    ['Toyota', 'Седан', '', 'Бензин', 2009.0, 100000.0, 'АКПП', 203.0, 2.5, 'Чита'],
    ['Toyota', 'Седан', '', 'Бензин', 2004.0, 205000.0, 'АКПП', 132.0, 1.8, 'Чита'],
    ['Daihatsu', 'Хэтчбек 5 дв.', '', 'Бензин', 2018.0, 70000.0, 'Вариатор', 49.0, 0.7, 'Чита'],
    ['Mitsubishi', 'Джип 5 дв.', '', 'Бензин', 1993.0, 300000.0, 'АКПП', 155.0, 3.0, 'Чита'],
    ['Toyota', 'Седан', '', 'Бензин', 2016.0, 14000.0, 'Вариатор', 109.0, 1.5, 'Чита'],
    ['Toyota', 'Седан', '', 'Бензин', 2019.0, 19000.0, 'Вариатор', 109.0, 1.5, 'Чита'],
    ['Toyota', 'Седан', '', 'Бензин', 2016.0, 14000.0, 'Вариатор', 109.0, 1.5, 'Чита'],
    ['Mitsubishi', 'Джип 5 дв.', '', 'Дизель', 2006.0, 370000.0, 'АКПП', 165.0, 3.2, 'Севастополь'],
    ['Toyota', 'Джип 5 дв.', '', 'Бензин', 2019.0, 28000.0, 'Вариатор', 98.0, 1.0, 'Чита'],
    ['Toyota', 'Джип 5 дв.', '', 'Бензин', 2019.0, 28000.0, 'Вариатор', 98.0, 1.0, 'Чита'],
    ['Toyota', 'Джип 5 дв.', '', 'Бензин', 2019.0, 28000.0, 'Вариатор', 98.0, 1.0, 'Чита'],
    ['Toyota', 'Минивэн', '', 'Бензин', 2014.0, 94000.0, 'Вариатор', 99.0, 1.8, 'Чита'],
    ['Toyota', 'Седан', '', 'Бензин', 2018.0, 97000.0, 'Вариатор', 184.0, 2.5, 'Чита'],
    ['Mercedes-Benz', 'Седан', '', 'Бензин', 2013.0, 187000.0, 'АКПП', 455.0, 4.7, 'Севастополь']
]

# Преобразование данных в DataFrame
columns = ['brand', 'bodyType', 'color', 'fuelType', 'year', 'mileage', 'transmission', 'power', 'engineDisplacement', 'location']
new_df = pd.DataFrame(data_to_check, columns=columns)

# Предсказание
predicted_classes = model.predict(new_df)
predicted_probabilities = model.predict_proba(new_df)[:, 1]

# Вывод результатов
for i, (car_data, pred_class, pred_prob) in enumerate(zip(data_to_check, predicted_classes, predicted_probabilities)):
    print(f"Автомобиль {i + 1}:")
    print(f"  Данные: {car_data}")
    print(f"  Предсказанный класс: {'Дороже миллиона' if pred_class == 1 else 'Не дороже миллиона'}")
    print(f"  Вероятность: {pred_prob:.2f}")
    print()